<a href="https://colab.research.google.com/github/Prasannas544/Business_Analytics/blob/main/22July.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
install.packages("tidyverse")

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

In [2]:
library(tidyverse)

Warning message in system("timedatectl", intern = TRUE):
“running command 'timedatectl' had status 1”
── Attaching packages ─────────────────────────────────────── tidyverse 1.3.2 ──
✔ ggplot2 3.3.6     ✔ purrr   0.3.4
✔ tibble  3.1.7     ✔ dplyr   1.0.9
✔ tidyr   1.2.0     ✔ stringr 1.4.0
✔ readr   2.1.2     ✔ forcats 0.5.1
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()

In [3]:
table1

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

In [ ]:
table4a    #untidy data as the columns arent variables and neither the rows are single observations

In [7]:
table4a %>%
  pivot_longer(cols=c('1999','2000'),names_to="year",values_to="cases")%>%   #tidy data  ... unpivoted from table4a  # columns to rows
  arrange(country,year)

  country     year cases
1 Afghanistan 1999    745
2 Afghanistan 2000   2666
3 Brazil      1999  37737
4 Brazil      2000  80488
5 China       1999 212258
6 China       2000 213766

In [ ]:
table2

In [9]:
table2 %>%
pivot_wider(names_from="type",values_from ="count" )  #pivot converted rows to columns...

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

In [10]:
table3

  country     year rate
1 Afghanistan 1999 745/19987071
2 Afghanistan 2000 2666/20595360
3 Brazil      1999 37737/172006362
4 Brazil      2000 80488/174504898
5 China       1999 212258/1272915272
6 China       2000 213766/1280428583

In [11]:
table3 %>% 
separate(rate,into=c("cases","population"),sep="/",convert=TRUE)  #n Split by delimiter
#separate(col_name,into=c(new col_names),sep="separator",convert=TRUE// to auto detect the datatypes in new columns)

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

In [13]:
table5

  country     century year rate
1 Afghanistan 19      99   745/19987071
2 Afghanistan 20      00   2666/20595360
3 Brazil      19      99   37737/172006362
4 Brazil      20      00   80488/174504898
5 China       19      99   212258/1272915272
6 China       20      00   213766/1280428583

In [ ]:
table5 %>%
unite(new,century,year) # merge columns...by default separator ="_"

In [18]:
table5 %>%
unite(year,century,year,sep="") %>%
separate(rate,into=c("cases","population"),sep="/",convert=TRUE)   # Made our data tidy by using "unite" and "separate" functions together

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

In [19]:
#Example Data 
stocks <-tibble(
  year=c(2015,2015,2015,2015,2016,2016,2016),
  qtr=c(1,2,3,4,2,3,4),
  yield=c(1.88,0.59,0.35,NA,0.91,0.17,2.66)
)

stocks

  year qtr yield
1 2015 1   1.88
2 2015 2   0.59
3 2015 3   0.35
4 2015 4     NA
5 2016 2   0.91
6 2016 3   0.17
7 2016 4   2.66

In [21]:
stocks %>%
fill(yield,.direction="down") # dealing with explicitly missing values

  year qtr yield
1 2015 1   1.88
2 2015 2   0.59
3 2015 3   0.35
4 2015 4   0.35
5 2016 2   0.91
6 2016 3   0.17
7 2016 4   2.66

In [ ]:
stocks %>%
complete(year,qtr) # dealing with implicitly missing values

In [ ]:
stocks %>%
complete(year,qtr) %>%
fill(yield,.direction="up")

In [27]:
df[is.na(df)]<-0

In [ ]:
df= data.frame(C1= c(1, 5, 14, NA, 54), C2= c(9, NA, NA, 3, 42), C3= c(9, 7, 42, 87, NA))
df

In [28]:
df

  C1 C2 C3
1  1  9  9
2  5  0  7
3 14  0 42
4  0  3 87
5 54 42  0